tuya/tuyaopen-platform-t5ai/t5_os/ap/middleware/soc/bk7257_ap/soc/gpio_map.h
// Copyright 2020-2021 Beken
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

#pragma once

#ifdef __cplusplus
extern "C" {
#endif

#include <stdio.h>
#include <driver/hal/hal_gpio_types.h>
#include <soc/soc.h>
#include "sdkconfig.h"

#define GPIO_DEV_MAP  \
{\
	{GPIO_0, {GPIO_DEV_UART1_TXD, GPIO_DEV_I2C1_SCL, GPIO_DEV_JTAG_TCK, GPIO_DEV_SCR_IO, GPIO_DEV_ADC12, GPIO_DEV_LIN_TXD, GPIO_DEV_INVALID, GPIO_DEV_INVALID}},\
	{GPIO_1, {GPIO_DEV_UART1_RXD, GPIO_DEV_I2C1_SDA, GPIO_DEV_JTAG_TMS, GPIO_DEV_SCR_CLK, GPIO_DEV_ADC13, GPIO_DEV_LIN_RXD, GPIO_DEV_INVALID, GPIO_DEV_INVALID}},\
	{GPIO_2, {GPIO_DEV_SPI1_SCK, GPIO_DEV_SDIO_HOST_CLK, GPIO_DEV_INVALID, GPIO_DEV_SCR_RSTN, GPIO_DEV_LIN_SLEEP, GPIO_DEV_INVALID, GPIO_DEV_QSPI1_CLK, GPIO_DEV_INVALID}},\
	{GPIO_3, {GPIO_DEV_SPI1_CSN, GPIO_DEV_SDIO_HOST_CMD, GPIO_DEV_INVALID, GPIO_DEV_SCR_VCC, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_QSPI1_CSN, GPIO_DEV_INVALID}},\
	{GPIO_4, {GPIO_DEV_SPI1_MOSI, GPIO_DEV_SDIO_HOST_DATA0, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_QSPI1_IO0, GPIO_DEV_INVALID}},\
	{GPIO_5, {GPIO_DEV_SPI1_MISO, GPIO_DEV_SDIO_HOST_DATA1, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_QSPI1_IO1, GPIO_DEV_INVALID}},\
	{GPIO_6, {GPIO_DEV_CLK13M, GPIO_DEV_PWM0, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_QSPI1_IO2, GPIO_DEV_INVALID}},\
	{GPIO_7, {GPIO_DEV_INVALID, GPIO_DEV_PWM1, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_QSPI1_IO3, GPIO_DEV_INVALID}},\
	{GPIO_8, {GPIO_DEV_BT_ACTIVE, GPIO_DEV_PWM2, GPIO_DEV_I2S1_DIN, GPIO_DEV_DMIC1_CLK, GPIO_DEV_ADC10, GPIO_DEV_DEBUG6, GPIO_DEV_CLK_32K_XO, GPIO_DEV_INVALID}},\
	{GPIO_9, {GPIO_DEV_BT_PRIORITY, GPIO_DEV_PWM3, GPIO_DEV_I2S1_DOUT, GPIO_DEV_DMIC1_DAT, GPIO_DEV_ADC11, GPIO_DEV_DEBUG7, GPIO_DEV_CLK_32K_XI, GPIO_DEV_INVALID}},\
	{GPIO_10,{GPIO_DEV_UART0_RXD, GPIO_DEV_SDIO_HOST_DATA2, GPIO_DEV_CLK_AUXS, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID}},\
	{GPIO_11, {GPIO_DEV_UART0_TXD, GPIO_DEV_SDIO_HOST_DATA3, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID}},\
	{GPIO_12, {GPIO_DEV_UART0_CTS, GPIO_DEV_USB0_DP, GPIO_DEV_INVALID, GPIO_DEV_TOUCH0, GPIO_DEV_ADC14, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID}},\
	{GPIO_13, {GPIO_DEV_UART0_RTS, GPIO_DEV_USB0_DN, GPIO_DEV_INVALID, GPIO_DEV_TOUCH1, GPIO_DEV_ADC15, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID}},\
	{GPIO_14, {GPIO_DEV_SDIO_HOST_CLK, GPIO_DEV_SPI0_SCK, GPIO_DEV_BT_ANT0, GPIO_DEV_I2C1_SCL, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID}},\
	{GPIO_15, {GPIO_DEV_SDIO_HOST_CMD, GPIO_DEV_SPI0_CSN, GPIO_DEV_BT_ANT1, GPIO_DEV_I2C1_SDA, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID}},\
	{GPIO_16, {GPIO_DEV_SDIO_HOST_DATA0, GPIO_DEV_SPI0_MOSI, GPIO_DEV_BT_ANT2, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID}},\
	{GPIO_17, {GPIO_DEV_SDIO_HOST_DATA1, GPIO_DEV_SPI0_MISO, GPIO_DEV_BT_ANT3, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID}},\
	{GPIO_18, {GPIO_DEV_SDIO_HOST_DATA2, GPIO_DEV_PWM0, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID}},\
	{GPIO_19, {GPIO_DEV_SDIO_HOST_DATA3, GPIO_DEV_PWM1, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID}},\
	{GPIO_20, {GPIO_DEV_I2C0_SCL, GPIO_DEV_JTAG_TCK, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID}},\
	{GPIO_21, {GPIO_DEV_I2C0_SDA, GPIO_DEV_JTAG_TMS, GPIO_DEV_ADC6,  GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID}},\
	{GPIO_22, {GPIO_DEV_CLK26M, GPIO_DEV_PWM2, GPIO_DEV_ADC5, GPIO_DEV_QSPI0_CLK, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID}},\
	{GPIO_23, {GPIO_DEV_INVALID, GPIO_DEV_PWM3, GPIO_DEV_ADC3, GPIO_DEV_QSPI0_CSN, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID}},\
	{GPIO_24, {GPIO_DEV_LPO_CLK, GPIO_DEV_PWM4, GPIO_DEV_ADC2,  GPIO_DEV_QSPI0_IO0, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID}},\
	{GPIO_25, {GPIO_DEV_IRDA, GPIO_DEV_PWM5, GPIO_DEV_ADC1, GPIO_DEV_QSPI0_IO1, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID}},\
	{GPIO_26, {GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_QSPI0_IO2, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID}},\
	{GPIO_27, {GPIO_DEV_JPEG_MCLK, GPIO_DEV_CLK_AUXS_CIS, GPIO_DEV_INVALID, GPIO_DEV_QSPI0_IO3, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID}},\
	{GPIO_28, {GPIO_DEV_RXEN, GPIO_DEV_I2S1_MCLK,  GPIO_DEV_ADC4, GPIO_DEV_TOUCH2, GPIO_DEV_CLK_AUXS, GPIO_DEV_DEBUG18, GPIO_DEV_INVALID, GPIO_DEV_SLCD_SEG18}},\
	{GPIO_29, {GPIO_DEV_JPEG_PCLK, GPIO_DEV_INVALID, GPIO_DEV_ENET_MDC, GPIO_DEV_TOUCH3, GPIO_DEV_INVALID, GPIO_DEV_DEBUG19, GPIO_DEV_INVALID, GPIO_DEV_SLCD_SEG19}},\
	{GPIO_30, {GPIO_DEV_JPEG_HSYNC, GPIO_DEV_UART2_RXD, GPIO_DEV_LIN_RXD, GPIO_DEV_TOUCH4, GPIO_DEV_SCR_CLK, GPIO_DEV_DEBUG20, GPIO_DEV_INVALID, GPIO_DEV_SLCD_SEG20}},\
	{GPIO_31, {GPIO_DEV_JPEG_VSYNC, GPIO_DEV_UART2_TXD, GPIO_DEV_LIN_TXD, GPIO_DEV_TOUCH5, GPIO_DEV_SCR_IO, GPIO_DEV_DEBUG21, GPIO_DEV_INVALID, GPIO_DEV_SLCD_SEG21}},\
	{GPIO_32, {GPIO_DEV_JPEG_PXDATA0, GPIO_DEV_PWM6, GPIO_DEV_ENET_MDIO, GPIO_DEV_TOUCH6, GPIO_DEV_SCR_RSTN, GPIO_DEV_DEBUG22, GPIO_DEV_INVALID, GPIO_DEV_SLCD_SEG22}},\
	{GPIO_33, {GPIO_DEV_JPEG_PXDATA1, GPIO_DEV_PWM7, GPIO_DEV_ENET_RXD0, GPIO_DEV_TOUCH7, GPIO_DEV_SPI0_SCK, GPIO_DEV_DEBUG23, GPIO_DEV_INVALID, GPIO_DEV_SLCD_SEG23}},\
	{GPIO_34, {GPIO_DEV_JPEG_PXDATA2, GPIO_DEV_PWM8, GPIO_DEV_ENET_RXD1, GPIO_DEV_TOUCH8, GPIO_DEV_SPI0_CSN, GPIO_DEV_DEBUG24, GPIO_DEV_INVALID, GPIO_DEV_SLCD_SEG24}},\
	{GPIO_35, {GPIO_DEV_JPEG_PXDATA3, GPIO_DEV_PWM9, GPIO_DEV_ENET_RXDV, GPIO_DEV_TOUCH9, GPIO_DEV_SPI0_MOSI, GPIO_DEV_DEBUG25, GPIO_DEV_INVALID, GPIO_DEV_SLCD_SEG25}},\
	{GPIO_36, {GPIO_DEV_JPEG_PXDATA4, GPIO_DEV_PWM10, GPIO_DEV_ENET_TXD0, GPIO_DEV_TOUCH10, GPIO_DEV_SPI0_MISO, GPIO_DEV_DEBUG26, GPIO_DEV_INVALID, GPIO_DEV_SLCD_SEG26}},\
	{GPIO_37, {GPIO_DEV_JPEG_PXDATA5, GPIO_DEV_PWM11, GPIO_DEV_ENET_TXD1, GPIO_DEV_TOUCH11, GPIO_DEV_INVALID, GPIO_DEV_DEBUG27, GPIO_DEV_INVALID, GPIO_DEV_SLCD_SEG27}},\
	{GPIO_38, {GPIO_DEV_JPEG_PXDATA6, GPIO_DEV_I2C1_SCL, GPIO_DEV_ENET_TXEN, GPIO_DEV_TOUCH12, GPIO_DEV_INVALID, GPIO_DEV_DEBUG28, GPIO_DEV_SLCD_COM4, GPIO_DEV_SLCD_SEG28}},\
	{GPIO_39, {GPIO_DEV_JPEG_PXDATA7, GPIO_DEV_I2C1_SDA, GPIO_DEV_ENET_REF_CLK, GPIO_DEV_TOUCH13, GPIO_DEV_INVALID, GPIO_DEV_DEBUG29, GPIO_DEV_SLCD_COM5, GPIO_DEV_SLCD_SEG29}},\
	{GPIO_40, {GPIO_DEV_UART2_RXD, GPIO_DEV_I2S2_CLK, GPIO_DEV_LIN_RXD, GPIO_DEV_SCR_CLK, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID}},\
	{GPIO_41, {GPIO_DEV_UART2_TXD, GPIO_DEV_I2S2_SYNC, GPIO_DEV_LIN_TXD, GPIO_DEV_SCR_IO, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID}},\
	{GPIO_42, {GPIO_DEV_I2C1_SCL, GPIO_DEV_I2S2_DIN, GPIO_DEV_LIN_SLEEP, GPIO_DEV_SCR_RSTN, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID}},\
	{GPIO_43, {GPIO_DEV_I2C1_SDA, GPIO_DEV_I2S2_DOUT, GPIO_DEV_INVALID, GPIO_DEV_SCR_VCC, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID}},\
	{GPIO_44, {GPIO_DEV_CAN_TX, GPIO_DEV_SPI0_SCK, GPIO_DEV_ADC10, GPIO_DEV_INVALID, GPIO_DEV_LCD_B6, GPIO_DEV_INVALID, GPIO_DEV_SLCD_COM3, GPIO_DEV_I2S3_CLK}},\
	{GPIO_45, {GPIO_DEV_CAN_RX, GPIO_DEV_SPI0_CSN, GPIO_DEV_ADC11, GPIO_DEV_INVALID, GPIO_DEV_LCD_B5, GPIO_DEV_INVALID, GPIO_DEV_SLCD_COM2, GPIO_DEV_I2S3_SYNC}},\
	{GPIO_46, {GPIO_DEV_CAN_STANDBY, GPIO_DEV_SPI0_MOSI, GPIO_DEV_ENET_PHY_INT, GPIO_DEV_TOUCH14, GPIO_DEV_LCD_B4, GPIO_DEV_INVALID, GPIO_DEV_SLCD_COM1, GPIO_DEV_I2S3_DIN}},\
	{GPIO_47, {GPIO_DEV_INVALID, GPIO_DEV_SPI0_MISO, GPIO_DEV_ENET_MDC, GPIO_DEV_TOUCH15, GPIO_DEV_LCD_B3, GPIO_DEV_INVALID, GPIO_DEV_SLCD_COM0, GPIO_DEV_I2S3_DOUT}},\
	{GPIO_48, {GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_ENET_MDIO, GPIO_DEV_INVALID, GPIO_DEV_LCD_R2, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID}},\
	{GPIO_49, {GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_ENET_RXD0, GPIO_DEV_INVALID, GPIO_DEV_LCD_R1, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID}},\
	{GPIO_50, {GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_ENET_RXD1, GPIO_DEV_INVALID, GPIO_DEV_LCD_R0, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID}},\
	{GPIO_51, {GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_ENET_RXDV, GPIO_DEV_INVALID, GPIO_DEV_LCD_G1, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID}},\
	{GPIO_52, {GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_ENET_TXD0, GPIO_DEV_INVALID, GPIO_DEV_LCD_G0, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID}},\
	{GPIO_53, {GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_ENET_TXD1, GPIO_DEV_INVALID, GPIO_DEV_LCD_B2, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID}},\
	{GPIO_54, {GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_ENET_TXEN, GPIO_DEV_INVALID, GPIO_DEV_LCD_B1, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID}},\
	{GPIO_55, {GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_ENET_REF_CLK, GPIO_DEV_INVALID, GPIO_DEV_LCD_B0, GPIO_DEV_INVALID, GPIO_DEV_INVALID, GPIO_DEV_INVALID}},\
}


#if CONFIG_GPIO_DEFAULT_SET_SUPPORT
#if !CONFIG_USR_GPIO_CFG_EN
/*
 typedef struct {
	 uint32_t gpio_id:				 6;  //gpio_id_t

	 uint32_t second_func_en:		 1;  //gpio_func_mode_t
	 uint32_t second_func_dev:		 8;  //gpio_dev_t

	 uint32_t io_mode:				 2;  //gpio_io_mode_t
	 uint32_t pull_mode:			 2;  //gpio_pull_mode_t

