tuya/tuyaopen-platform-t5ai/t5_os/ap/middleware/soc/bk7257_ap/soc/gpio_map.h
#define GPIO_CTRL_LDO_OUTPUT_LOW_MAP  \
{\
	/* GPIO_4, */\
	/* GPIO_26, */\
}

/*
 * Camera DVP GPIO MAP
 */
#define CAMERA_DVP_MCLK_PIN             (GPIO_27)
#define CAMERA_DVP_PCLK_PIN             (GPIO_29)
#define CAMERA_DVP_HSYNC_PIN            (GPIO_30)
#define CAMERA_DVP_VSYNC_PIN            (GPIO_31)
#define CAMERA_DVP_PXDATA0_PIN          (GPIO_32)
#define CAMERA_DVP_PXDATA1_PIN          (GPIO_33)
#define CAMERA_DVP_PXDATA2_PIN          (GPIO_34)
#define CAMERA_DVP_PXDATA3_PIN          (GPIO_35)
#define CAMERA_DVP_PXDATA4_PIN          (GPIO_36)
#define CAMERA_DVP_PXDATA5_PIN          (GPIO_37)
#define CAMERA_DVP_PXDATA6_PIN          (GPIO_38)
#define CAMERA_DVP_PXDATA7_PIN          (GPIO_39)

#define CAMERA_DVP_MCLK_FUNC            (GPIO_DEV_JPEG_MCLK)
#define CAMERA_DVP_AUXS_FUNC            (GPIO_DEV_CLK_AUXS)
#define CAMERA_DVP_PCLK_FUNC            (GPIO_DEV_JPEG_PCLK)
#define CAMERA_DVP_HSYNC_FUNC           (GPIO_DEV_JPEG_HSYNC)
#define CAMERA_DVP_VSYNC_FUNC           (GPIO_DEV_JPEG_VSYNC)
#define CAMERA_DVP_PXDATA0_FUNC         (GPIO_DEV_JPEG_PXDATA0)
#define CAMERA_DVP_PXDATA1_FUNC         (GPIO_DEV_JPEG_PXDATA1)
#define CAMERA_DVP_PXDATA2_FUNC         (GPIO_DEV_JPEG_PXDATA2)
#define CAMERA_DVP_PXDATA3_FUNC         (GPIO_DEV_JPEG_PXDATA3)
#define CAMERA_DVP_PXDATA4_FUNC         (GPIO_DEV_JPEG_PXDATA4)
#define CAMERA_DVP_PXDATA5_FUNC         (GPIO_DEV_JPEG_PXDATA5)
#define CAMERA_DVP_PXDATA6_FUNC         (GPIO_DEV_JPEG_PXDATA6)
#define CAMERA_DVP_PXDATA7_FUNC         (GPIO_DEV_JPEG_PXDATA7)

#define CAMERA_DVP_I2C_ID               (CONFIG_DVP_CAMERA_I2C_ID)
#define CAMERA_DVP_I2C_BAUD_RATE        (I2C_BAUD_RATE_100KHZ)
#define CAMERA_DVP_I2C_MODE             (I2C_ADDR_MODE_7BIT)

/*
 * LCD RGB GPIO MAP
 */
#define LCD_RGB_R0_PIN 				(GPIO_50)
#define LCD_RGB_R1_PIN 				(GPIO_49)
#define LCD_RGB_R2_PIN 				(GPIO_48)
#define LCD_RGB_R3_PIN 				(GPIO_23)
#define LCD_RGB_R4_PIN 				(GPIO_22)
#define LCD_RGB_R5_PIN 				(GPIO_21)
#define LCD_RGB_R6_PIN 				(GPIO_20)
#define LCD_RGB_R7_PIN 				(GPIO_19)
#define LCD_RGB_G0_PIN 				(GPIO_52)
#define LCD_RGB_G1_PIN 				(GPIO_51)
#define LCD_RGB_G2_PIN 				(GPIO_42)
#define LCD_RGB_G3_PIN 				(GPIO_41)
#define LCD_RGB_G4_PIN 				(GPIO_40)
#define LCD_RGB_G5_PIN 				(GPIO_26)
#define LCD_RGB_G6_PIN 				(GPIO_25)
#define LCD_RGB_G7_PIN 				(GPIO_24)
#define LCD_RGB_B0_PIN 				(GPIO_55)
#define LCD_RGB_B1_PIN 				(GPIO_54)
#define LCD_RGB_B2_PIN 				(GPIO_53)
#define LCD_RGB_B3_PIN 				(GPIO_47)
#define LCD_RGB_B4_PIN 				(GPIO_46)
#define LCD_RGB_B5_PIN 				(GPIO_45)
#define LCD_RGB_B6_PIN 				(GPIO_44)
#define LCD_RGB_B7_PIN 				(GPIO_43)
#define LCD_RGB_CLK_PIN 			(GPIO_14)
#define LCD_RGB_DISP_PIN 			(GPIO_15)
#define LCD_RGB_DE_PIN 				(GPIO_16)
#define LCD_RGB_HSYNC_PIN 			(GPIO_17)
#define LCD_RGB_VSYNC_PIN 			(GPIO_18)


#define LCD_RGB_R0_FUNC 			(GPIO_DEV_LCD_R0)
#define LCD_RGB_R1_FUNC 			(GPIO_DEV_LCD_R1)
#define LCD_RGB_R2_FUNC 			(GPIO_DEV_LCD_R2)
#define LCD_RGB_R3_FUNC 			(GPIO_DEV_LCD_R3)
#define LCD_RGB_R4_FUNC 			(GPIO_DEV_LCD_R4)
#define LCD_RGB_R5_FUNC 			(GPIO_DEV_LCD_R5)
#define LCD_RGB_R6_FUNC 			(GPIO_DEV_LCD_R6)
#define LCD_RGB_R7_FUNC 			(GPIO_DEV_LCD_R7)

#define LCD_RGB_G0_FUNC 			(GPIO_DEV_LCD_G0)
#define LCD_RGB_G1_FUNC 			(GPIO_DEV_LCD_G1)
#define LCD_RGB_G2_FUNC 			(GPIO_DEV_LCD_G2)
#define LCD_RGB_G3_FUNC 			(GPIO_DEV_LCD_G3)
#define LCD_RGB_G4_FUNC 			(GPIO_DEV_LCD_G4)
#define LCD_RGB_G5_FUNC 			(GPIO_DEV_LCD_G5)
#define LCD_RGB_G6_FUNC 			(GPIO_DEV_LCD_G6)
#define LCD_RGB_G7_FUNC 			(GPIO_DEV_LCD_G7)

#define LCD_RGB_B0_FUNC 			(GPIO_DEV_LCD_B0)
#define LCD_RGB_B1_FUNC 			(GPIO_DEV_LCD_B1)
#define LCD_RGB_B2_FUNC 			(GPIO_DEV_LCD_B2)
#define LCD_RGB_B3_FUNC 			(GPIO_DEV_LCD_B3)
#define LCD_RGB_B4_FUNC 			(GPIO_DEV_LCD_B4)
#define LCD_RGB_B5_FUNC 			(GPIO_DEV_LCD_B5)
#define LCD_RGB_B6_FUNC 			(GPIO_DEV_LCD_B6)
#define LCD_RGB_B7_FUNC 			(GPIO_DEV_LCD_B7)

#define LCD_RGB_CLK_FUNC 			(GPIO_DEV_LCD_CLK)
#define LCD_RGB_DISP_FUNC 			(GPIO_DEV_LCD_DISP)
#define LCD_RGB_HSYNC_FUNC 			(GPIO_DEV_LCD_HSYNC)
#define LCD_RGB_VSYNC_FUNC 			(GPIO_DEV_LCD_VSYNC)
#define LCD_RGB_DE_FUNC 			(GPIO_DEV_LCD_DE)

/*
 * LCD MCU GPIO MAP
 */
#define LCD_MCU_D0_PIN 				(GPIO_47)
#define LCD_MCU_D1_PIN 				(GPIO_46)
#define LCD_MCU_D2_PIN 				(GPIO_45)
#define LCD_MCU_D3_PIN 				(GPIO_44)
#define LCD_MCU_D4_PIN 				(GPIO_43)
#define LCD_MCU_D5_PIN 				(GPIO_42)
#define LCD_MCU_D6_PIN 				(GPIO_41)
#define LCD_MCU_D7_PIN 				(GPIO_40)
#define LCD_MCU_D8_PIN 				(GPIO_21)
#define LCD_MCU_D9_PIN 				(GPIO_20)
#define LCD_MCU_D10_PIN 			(GPIO_19)
#define LCD_MCU_D11_PIN 			(GPIO_18)
#define LCD_MCU_D12_PIN 			(GPIO_17)
#define LCD_MCU_D13_PIN 			(GPIO_16)
#define LCD_MCU_D14_PIN 			(GPIO_15)
#define LCD_MCU_D15_PIN 			(GPIO_14)
#define LCD_MCU_D16_PIN 			(GPIO_48)
#define LCD_MCU_D17_PIN 			(GPIO_49)
#define LCD_MCU_RDX_PIN 		 	(GPIO_26)
#define LCD_MCU_WRX_PIN 		 	(GPIO_25)
#define LCD_MCU_RSX_PIN 		 	(GPIO_24)
#define LCD_MCU_RESET_PIN 		 	(GPIO_23)
#define LCD_MCU_CSX_PIN 		 	(GPIO_22)

#define LCD_MCU_D0_FUNC 			(GPIO_DEV_LCD_B3)
#define LCD_MCU_D1_FUNC 			(GPIO_DEV_LCD_B4)
#define LCD_MCU_D2_FUNC 			(GPIO_DEV_LCD_B5)
#define LCD_MCU_D3_FUNC 			(GPIO_DEV_LCD_B6)
#define LCD_MCU_D4_FUNC 			(GPIO_DEV_LCD_B7)
#define LCD_MCU_D5_FUNC 			(GPIO_DEV_LCD_G2)
#define LCD_MCU_D6_FUNC 			(GPIO_DEV_LCD_G3)
#define LCD_MCU_D7_FUNC 			(GPIO_DEV_LCD_G4)
#define LCD_MCU_D8_FUNC 			(GPIO_DEV_LCD_R5)
#define LCD_MCU_D9_FUNC 			(GPIO_DEV_LCD_R6)
#define LCD_MCU_D10_FUNC 			(GPIO_DEV_LCD_R7)
#define LCD_MCU_D11_FUNC 			(GPIO_DEV_LCD_VSYNC)
#define LCD_MCU_D12_FUNC 			(GPIO_DEV_LCD_HSYNC)
#define LCD_MCU_D13_FUNC 			(GPIO_DEV_LCD_DE)
#define LCD_MCU_D14_FUNC 			(GPIO_DEV_LCD_DISP)
#define LCD_MCU_D15_FUNC 			(GPIO_DEV_LCD_CLK)
#define LCD_MCU_D16_FUNC 			(GPIO_DEV_LCD_R2)
#define LCD_MCU_D17_FUNC 			(GPIO_DEV_LCD_R1)
#define LCD_MCU_RDX_FUNC 		 	(GPIO_DEV_LCD_G5)
#define LCD_MCU_WRX_FUNC 		 	(GPIO_DEV_LCD_G6)
#define LCD_MCU_RSX_FUNC 		 	(GPIO_DEV_LCD_G7)
#define LCD_MCU_RESET_FUNC 		 	(GPIO_DEV_LCD_R3)
#define LCD_MCU_CSX_FUNC 		 	(GPIO_DEV_LCD_R4)

