tuya/tuyaopen-platform-t5ai/t5_os/ap/middleware/soc/bk7257_ap/soc/gpio_map.h
/*
* AUDIO PA GPIO MAP
*/
#ifdef CONFIG_AUD_DAC_PA_CTRL_GPIO
#define AUD_DAC_PA_CTRL_GPIO CONFIG_AUD_DAC_PA_CTRL_GPIO
#else
#define AUD_DAC_PA_CTRL_GPIO		(GPIO_5)
#endif
#define AUD_DAC_PA_ENABLE_LEVEL		(1)

/*
* VIDEO PA GPIO MAP
*/
// LCD AND SD POWER CTRL
#if CONFIG_LDO3V3_CTRL_GPIO
#define LCD_LDO_CTRL_GPIO                  (CONFIG_LDO3V3_CTRL_GPIO)
#define LCD_LDO_CTRL_ACTIVE_LEVEL          (1)
#else
#define LCD_LDO_CTRL_GPIO                  (GPIO_42)
#define LCD_LDO_CTRL_ACTIVE_LEVEL          (1)
#endif

#if CONFIG_LDO3V3_CTRL_GPIO
#define SDCARD_LDO_CTRL_GPIO               (CONFIG_LDO3V3_CTRL_GPIO)
#define SDCARD_LDO_CTRL_ACTIVE_LEVEL       (1)
#else
#define SDCARD_LDO_CTRL_GPIO               (GPIO_42)
#define SDCARD_LDO_CTRL_ACTIVE_LEVEL       (1)
#endif

#if CONFIG_LDO3V3_CTRL_GPIO
#define MOTOR_LDO_CTRL_GPIO                  (CONFIG_LDO3V3_CTRL_GPIO)
#define MOTOR_LDO_CTRL_ACTIVE_LEVEL          (1)
#else
#define MOTOR_LDO_CTRL_GPIO                  (GPIO_42)
#define MOTOR_LDO_CTRL_ACTIVE_LEVEL          (1)
#endif


// LCD BACKLIGHT CTRL
#define LCD_BACKLIGHT_CTRL_ACTIVE_LEVEL    (1)

/*---multi modules use one gpio to control different ldo---*/
#define GPIO_CTRL_LDO_MAP  \
{\
	{GPIO_20,  GPIO_OUTPUT_STATE_LOW},\
	{GPIO_42,  GPIO_OUTPUT_STATE_LOW},\
}

#if CONFIG_GPIO_WAKEUP_SUPPORT
#if CONFIG_DEFAULT_WAKEUP_SOURCE
#define GPIO_STATIC_WAKEUP_SOURCE_MAP  \
	{\
		/* {GPIO_5, GPIO_INT_TYPE_LOW_LEVEL}, */ \
		{GPIO_10, GPIO_INT_TYPE_FALLING_EDGE},\
		/*{GPIO_40, GPIO_INT_LEVEL_LOW},*/ \
	}
#else
#define GPIO_STATIC_WAKEUP_SOURCE_MAP  \
	{\
		/* {GPIO_5, GPIO_INT_TYPE_LOW_LEVEL}, */ \
		/*{GPIO_10, GPIO_INT_TYPE_FALLING_EDGE}, */\
		/*{GPIO_40, GPIO_INT_LEVEL_LOW},*/ \
	}
#endif

#define GPIO_CTRL_LDO_OUTPUT_HIGH_MAP  \
	{\
		/* GPIO_2, */\
		/* GPIO_28, */\
	}

#define GPIO_CTRL_LDO_OUTPUT_LOW_MAP  \
	{\
		/* GPIO_4, */\
		/* GPIO_26, */\
	}

#endif

#define IRDA_PIN    (GPIO_25)

#ifdef __cplusplus
}
#endif
